backend-api/app/Controllers/BookController.php

SELECT *
FROM `books`
ORDER BY `id` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();
        $books = $db->table('books')->orderBy('id', 'DESC')->get()->getResultArray();