backend-api/app/Controllers/RentalController.php

SELECT `rentals`.`id` as `rental_id`, `rentals`.`return_date`, `rentals`.`status` as `rental_status`, `books`.`title` as `title`, `books`.`genre`, `members`.`name` as `member_name`, `members`.`email` as `member_email`
FROM `rentals`
LEFT JOIN `books` ON `books`.`id` = `rentals`.`book_id`
LEFT JOIN `members` ON `members`.`id` = `rentals`.`member_id`
---
    public function getRentals()
    {
        $db = \Config\Database::connect();

        // SINKRONISASI: Menambahkan 'books.image_url as image_url' agar dilempar ke frontend
        $query = $db->table('rentals')
            ->select('rentals.id as rental_id, rentals.return_date, rentals.status as rental_status,
                      books.title as title, books.genre, books.image_url as image_url,
                      members.name as member_name, members.email as member_email')
            ->join('books', 'books.id = rentals.book_id', 'left')
            ->join('members', 'members.id = rentals.member_id', 'left')
            ->get()
            ->getResultArray();